### **Operations**

In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

To display the first 5 rows of a DataFrame use the method `.head()`

## **Unique Values**

`.unique()` returns a NumPy array containing the unique values from a Pandas Series, in the order they appear.

`.nunique` returns the number of unique values for each column.

In [4]:
df['col2'].nunique() # .unique() and .nunique()

3

In [5]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

## **Selecting Data**

In [6]:
# Select from DataFrame using criteria from multiple columns
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

## **Applying Functions**

In [12]:
def times2(x):
    return x*2

In [14]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [17]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [18]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

`.columns` returns the column labels of the DataFrame.

In [19]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

`.index` returns the index labels of the DataFrame.

In [20]:
df.index

RangeIndex(start=0, stop=4, step=1)

### **Sorting and Ordering a DataFrame**

`.sort_values(by, axis)` sort according to the defined parameters within the method.

In [25]:
# inplace=False by default
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

`.isnull()` finds or checks for null values.

In [ ]:
df.isnull()

In [28]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [30]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN